---
kind: method
id: M:Autodesk.Revit.DB.NurbsSurfaceData.GetWeights
source: html/a1eec836-1db9-00ef-98eb-923c6a77a952.htm
---
# Autodesk.Revit.DB.NurbsSurfaceData.GetWeights Method

Get the list of weights.

## Syntax (C#)
```csharp
public IList<double> GetWeights()
```